yuchou87/xiaoputao-speaker/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# PSRAM: 8MB octal @ 80MHz
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Flash 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# CPU 240MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Console over USB-Serial-JTAG (this board's USB-C)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
